### Terraform Plan
```diff

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # module.ecr.aws_ecr_repository.citest will be created
  + resource "aws_ecr_repository" "citest" {
      + arn                  = (known after apply)
      + force_delete         = true
      + id                   = (known after apply)
      + image_tag_mutability = "MUTABLE"
      + name                 = "selvoc-dev-citest"
      + registry_id          = (known after apply)
      + repository_url       = (known after apply)
      + tags                 = {
          + "Environment" = "dev"
          + "Project"     = "selvoc"
        }
      + tags_all             = {
          + "Environment" = "dev"
          + "Project"     = "selvoc"
        }
    }

  # module.eks.aws_eks_access_entry.admin_roles["caller"] must be replaced
-/+ resource "aws_eks_access_entry" "admin_roles" {
      ~ access_entry_arn  = "arn:aws:eks:eu-central-1:350784048443:access-entry/selvoc-dev-eks/user/350784048443/bobo-terraform/becb8965-2d92-80f2-6a87-e86450c49490" -> (known after apply)
      ~ created_at        = "2025-05-27T17:29:01Z" -> (known after apply)
      ~ id                = "selvoc-dev-eks:arn:aws:iam::350784048443:user/bobo-terraform" -> (known after apply)
      ~ modified_at       = "2025-05-27T17:29:01Z" -> (known after apply)
      ~ principal_arn     = "arn:aws:iam::350784048443:user/bobo-terraform" -> "arn:aws:sts::350784048443:assumed-role/cicd-role/GitHubActionsTerraform" # forces replacement
      - tags              = {} -> null
      ~ user_name         = "arn:aws:iam::350784048443:user/bobo-terraform" -> (known after apply)
        # (4 unchanged attributes hidden)
    }

  # module.eks.aws_eks_access_policy_association.admin_roles["caller"] must be replaced
-/+ resource "aws_eks_access_policy_association" "admin_roles" {
      ~ associated_at = "2025-05-27 17:29:10.164 +0000 UTC" -> (known after apply)
      ~ id            = "selvoc-dev-eks#arn:aws:iam::350784048443:user/bobo-terraform#arn:aws:eks::aws:cluster-access-policy/AmazonEKSClusterAdminPolicy" -> (known after apply)
      ~ modified_at   = "2025-05-27 17:29:10.164 +0000 UTC" -> (known after apply)
      ~ principal_arn = "arn:aws:iam::350784048443:user/bobo-terraform" -> "arn:aws:sts::350784048443:assumed-role/cicd-role/GitHubActionsTerraform" # forces replacement
        # (2 unchanged attributes hidden)

      ~ access_scope {
          - namespaces = [] -> null
            # (1 unchanged attribute hidden)
        }
    }

Plan: 3 to add, 0 to change, 2 to destroy.

```
